---
kind: type
id: T:Autodesk.Revit.DB.TableSectionData
source: html/a0e6f821-5f53-1eb0-eba1-16554b3c0dc8.htm
---
# Autodesk.Revit.DB.TableSectionData

The TableSectionData class represents a serialized version of an instance of
 section table data. The class holds row, column and cell data.

## Syntax (C#)
```csharp
public class TableSectionData : IDisposable
```